{
  "MA.6.AR.1.1": {
    "code": "MA.6.AR.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 6 learners in Mathematics can interpret ratios to describe relationships between quantities.",
      "Provide scaffolds, models, and non-examples that help students interpret ratios to describe relationships between quantities in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will interpret ratios to describe relationships between quantities with grade-level appropriate rigor.",
      "Students will explain their reasoning while they interpret ratios to describe relationships between quantities.",
      "Students will transfer their understanding to real-world contexts that require them to interpret ratios to describe relationships between quantities."
    ]
  },
  "MA.6.AR.2.2": {
    "code": "MA.6.AR.2.2",
    "clarifications": [
      "Clarify success criteria so Grade 6 learners in Mathematics can solve real-world problems involving division of fractions.",
      "Provide scaffolds, models, and non-examples that help students solve real-world problems involving division of fractions in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will solve real-world problems involving division of fractions with grade-level appropriate rigor.",
      "Students will explain their reasoning while they solve real-world problems involving division of fractions.",
      "Students will transfer their understanding to real-world contexts that require them to solve real-world problems involving division of fractions."
    ]
  },
  "MA.7.AR.1.1": {
    "code": "MA.7.AR.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Mathematics can apply properties of operations to add and subtract linear expressions with rational coefficients.",
      "Provide scaffolds, models, and non-examples that help students apply properties of operations to add and subtract linear expressions with rational coefficients in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will apply properties of operations to add and subtract linear expressions with rational coefficients with grade-level appropriate rigor.",
      "Students will explain their reasoning while they apply properties of operations to add and subtract linear expressions with rational coefficients.",
      "Students will transfer their understanding to real-world contexts that require them to apply properties of operations to add and subtract linear expressions with rational coefficients."
    ]
  },
  "MA.7.AR.2.1": {
    "code": "MA.7.AR.2.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Mathematics can write and solve one-step inequalities in one variable within a mathematical context.",
      "Provide scaffolds, models, and non-examples that help students write and solve one-step inequalities in one variable within a mathematical context in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will write and solve one-step inequalities in one variable within a mathematical context with grade-level appropriate rigor.",
      "Students will explain their reasoning while they write and solve one-step inequalities in one variable within a mathematical context.",
      "Students will transfer their understanding to real-world contexts that require them to write and solve one-step inequalities in one variable within a mathematical context."
    ]
  },
  "MA.7.AR.3.1": {
    "code": "MA.7.AR.3.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Mathematics can solve multi-step percent problems involving discounts and markups.",
      "Provide scaffolds, models, and non-examples that help students solve multi-step percent problems involving discounts and markups in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will solve multi-step percent problems involving discounts and markups with grade-level appropriate rigor.",
      "Students will explain their reasoning while they solve multi-step percent problems involving discounts and markups.",
      "Students will transfer their understanding to real-world contexts that require them to solve multi-step percent problems involving discounts and markups."
    ]
  },
  "MA.8.F.1.1": {
    "code": "MA.8.F.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 8 learners in Mathematics can compare properties of two functions represented in different ways.",
      "Provide scaffolds, models, and non-examples that help students compare properties of two functions represented in different ways in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare properties of two functions represented in different ways with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare properties of two functions represented in different ways.",
      "Students will transfer their understanding to real-world contexts that require them to compare properties of two functions represented in different ways."
    ]
  },
  "MA.8.F.2.3": {
    "code": "MA.8.F.2.3",
    "clarifications": [
      "Clarify success criteria so Grade 8 learners in Mathematics can use functions to model relationships between quantities.",
      "Provide scaffolds, models, and non-examples that help students use functions to model relationships between quantities in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will use functions to model relationships between quantities with grade-level appropriate rigor.",
      "Students will explain their reasoning while they use functions to model relationships between quantities.",
      "Students will transfer their understanding to real-world contexts that require them to use functions to model relationships between quantities."
    ]
  },
  "ELA.6.R.1.1": {
    "code": "ELA.6.R.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 6 learners in English Language Arts can analyze how themes are developed through details.",
      "Provide scaffolds, models, and non-examples that help students analyze how themes are developed through details in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze how themes are developed through details with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze how themes are developed through details.",
      "Students will transfer their understanding to real-world contexts that require them to analyze how themes are developed through details."
    ]
  },
  "ELA.6.R.2.2": {
    "code": "ELA.6.R.2.2",
    "clarifications": [
      "Clarify success criteria so Grade 6 learners in English Language Arts can explain how text structures contribute to the central idea.",
      "Provide scaffolds, models, and non-examples that help students explain how text structures contribute to the central idea in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain how text structures contribute to the central idea with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain how text structures contribute to the central idea.",
      "Students will transfer their understanding to real-world contexts that require them to explain how text structures contribute to the central idea."
    ]
  },
  "ELA.7.C.1.2": {
    "code": "ELA.7.C.1.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can write personal or fictional narratives using narrative techniques, a recognizable point of view, precise words and phrases, and figurative language.",
      "Provide scaffolds, models, and non-examples that help students write personal or fictional narratives using narrative techniques, a recognizable point of view, precise words and phrases, and figurative language in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will write personal or fictional narratives using narrative techniques, a recognizable point of view, precise words and phrases, and figurative language with grade-level appropriate rigor.",
      "Students will explain their reasoning while they write personal or fictional narratives using narrative techniques, a recognizable point of view, precise words and phrases, and figurative language.",
      "Students will transfer their understanding to real-world contexts that require them to write personal or fictional narratives using narrative techniques, a recognizable point of view, precise words and phrases, and figurative language."
    ]
  },
  "ELA.7.C.1.3": {
    "code": "ELA.7.C.1.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, a logical organizational structure with varied transitions, and acknowledging at least one counterclaim.",
      "Provide scaffolds, models, and non-examples that help students write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, a logical organizational structure with varied transitions, and acknowledging at least one counterclaim in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, a logical organizational structure with varied transitions, and acknowledging at least one counterclaim with grade-level appropriate rigor.",
      "Students will explain their reasoning while they write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, a logical organizational structure with varied transitions, and acknowledging at least one counterclaim.",
      "Students will transfer their understanding to real-world contexts that require them to write and support a claim using logical reasoning, relevant evidence from multiple sources, elaboration, a logical organizational structure with varied transitions, and acknowledging at least one counterclaim."
    ]
  },
  "ELA.7.C.1.4": {
    "code": "ELA.7.C.1.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can write expository texts to explain and analyze information from multiple sources, using relevant supporting details and a logical organizational pattern.",
      "Provide scaffolds, models, and non-examples that help students write expository texts to explain and analyze information from multiple sources, using relevant supporting details and a logical organizational pattern in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will write expository texts to explain and analyze information from multiple sources, using relevant supporting details and a logical organizational pattern with grade-level appropriate rigor.",
      "Students will explain their reasoning while they write expository texts to explain and analyze information from multiple sources, using relevant supporting details and a logical organizational pattern.",
      "Students will transfer their understanding to real-world contexts that require them to write expository texts to explain and analyze information from multiple sources, using relevant supporting details and a logical organizational pattern."
    ]
  },
  "ELA.7.C.1.5": {
    "code": "ELA.7.C.1.5",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can improve writing by planning, revising, and editing, considering feedback from adults and peers.",
      "Provide scaffolds, models, and non-examples that help students improve writing by planning, revising, and editing, considering feedback from adults and peers in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will improve writing by planning, revising, and editing, considering feedback from adults and peers with grade-level appropriate rigor.",
      "Students will explain their reasoning while they improve writing by planning, revising, and editing, considering feedback from adults and peers.",
      "Students will transfer their understanding to real-world contexts that require them to improve writing by planning, revising, and editing, considering feedback from adults and peers."
    ]
  },
  "ELA.7.C.2.1": {
    "code": "ELA.7.C.2.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can present information orally, in a logical sequence, emphasizing key points that support the central idea.",
      "Provide scaffolds, models, and non-examples that help students present information orally, in a logical sequence, emphasizing key points that support the central idea in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will present information orally, in a logical sequence, emphasizing key points that support the central idea with grade-level appropriate rigor.",
      "Students will explain their reasoning while they present information orally, in a logical sequence, emphasizing key points that support the central idea.",
      "Students will transfer their understanding to real-world contexts that require them to present information orally, in a logical sequence, emphasizing key points that support the central idea."
    ]
  },
  "ELA.7.C.3.1": {
    "code": "ELA.7.C.3.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level.",
      "Provide scaffolds, models, and non-examples that help students follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level with grade-level appropriate rigor.",
      "Students will explain their reasoning while they follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level.",
      "Students will transfer their understanding to real-world contexts that require them to follow the rules of standard English grammar, punctuation, capitalization, and spelling appropriate to grade level."
    ]
  },
  "ELA.7.C.4.1": {
    "code": "ELA.7.C.4.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can conduct research to answer a question, drawing on multiple reliable and valid sources, and generating additional questions for further research.",
      "Provide scaffolds, models, and non-examples that help students conduct research to answer a question, drawing on multiple reliable and valid sources, and generating additional questions for further research in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will conduct research to answer a question, drawing on multiple reliable and valid sources, and generating additional questions for further research with grade-level appropriate rigor.",
      "Students will explain their reasoning while they conduct research to answer a question, drawing on multiple reliable and valid sources, and generating additional questions for further research.",
      "Students will transfer their understanding to real-world contexts that require them to conduct research to answer a question, drawing on multiple reliable and valid sources, and generating additional questions for further research."
    ]
  },
  "ELA.7.C.5.1": {
    "code": "ELA.7.C.5.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can integrate diverse digital media to build cohesion in oral or written tasks.",
      "Provide scaffolds, models, and non-examples that help students integrate diverse digital media to build cohesion in oral or written tasks in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will integrate diverse digital media to build cohesion in oral or written tasks with grade-level appropriate rigor.",
      "Students will explain their reasoning while they integrate diverse digital media to build cohesion in oral or written tasks.",
      "Students will transfer their understanding to real-world contexts that require them to integrate diverse digital media to build cohesion in oral or written tasks."
    ]
  },
  "ELA.7.C.5.2": {
    "code": "ELA.7.C.5.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can use digital tools to produce and share writing.",
      "Provide scaffolds, models, and non-examples that help students use digital tools to produce and share writing in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will use digital tools to produce and share writing with grade-level appropriate rigor.",
      "Students will explain their reasoning while they use digital tools to produce and share writing.",
      "Students will transfer their understanding to real-world contexts that require them to use digital tools to produce and share writing."
    ]
  },
  "ELA.7.R.1.1": {
    "code": "ELA.7.R.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can analyze the impact of setting on character development and plot in a literary text.",
      "Provide scaffolds, models, and non-examples that help students analyze the impact of setting on character development and plot in a literary text in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the impact of setting on character development and plot in a literary text with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the impact of setting on character development and plot in a literary text.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the impact of setting on character development and plot in a literary text."
    ]
  },
  "ELA.7.R.1.2": {
    "code": "ELA.7.R.1.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can compare two or more themes and their development throughout a literary text.",
      "Provide scaffolds, models, and non-examples that help students compare two or more themes and their development throughout a literary text in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare two or more themes and their development throughout a literary text with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare two or more themes and their development throughout a literary text.",
      "Students will transfer their understanding to real-world contexts that require them to compare two or more themes and their development throughout a literary text."
    ]
  },
  "ELA.7.R.1.3": {
    "code": "ELA.7.R.1.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can explain the influence of narrator(s), including unreliable narrator(s), and/or shifts in point of view in a literary text.",
      "Provide scaffolds, models, and non-examples that help students explain the influence of narrator(s), including unreliable narrator(s), and/or shifts in point of view in a literary text in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the influence of narrator(s), including unreliable narrator(s), and/or shifts in point of view in a literary text with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the influence of narrator(s), including unreliable narrator(s), and/or shifts in point of view in a literary text.",
      "Students will transfer their understanding to real-world contexts that require them to explain the influence of narrator(s), including unreliable narrator(s), and/or shifts in point of view in a literary text."
    ]
  },
  "ELA.7.R.1.4": {
    "code": "ELA.7.R.1.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can analyze the impact of various poetic forms on meaning and style.",
      "Provide scaffolds, models, and non-examples that help students analyze the impact of various poetic forms on meaning and style in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the impact of various poetic forms on meaning and style with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the impact of various poetic forms on meaning and style.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the impact of various poetic forms on meaning and style."
    ]
  },
  "ELA.7.R.2.1": {
    "code": "ELA.7.R.2.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can explain how individual text sections and/or features convey a purpose in texts.",
      "Provide scaffolds, models, and non-examples that help students explain how individual text sections and/or features convey a purpose in texts in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain how individual text sections and/or features convey a purpose in texts with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain how individual text sections and/or features convey a purpose in texts.",
      "Students will transfer their understanding to real-world contexts that require them to explain how individual text sections and/or features convey a purpose in texts."
    ]
  },
  "ELA.7.R.2.2": {
    "code": "ELA.7.R.2.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can compare two or more central ideas and their development throughout a text.",
      "Provide scaffolds, models, and non-examples that help students compare two or more central ideas and their development throughout a text in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare two or more central ideas and their development throughout a text with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare two or more central ideas and their development throughout a text.",
      "Students will transfer their understanding to real-world contexts that require them to compare two or more central ideas and their development throughout a text."
    ]
  },
  "ELA.7.R.2.3": {
    "code": "ELA.7.R.2.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can explain how an author establishes and achieves purpose(s) through diction and syntax.",
      "Provide scaffolds, models, and non-examples that help students explain how an author establishes and achieves purpose(s) through diction and syntax in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain how an author establishes and achieves purpose(s) through diction and syntax with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain how an author establishes and achieves purpose(s) through diction and syntax.",
      "Students will transfer their understanding to real-world contexts that require them to explain how an author establishes and achieves purpose(s) through diction and syntax."
    ]
  },
  "ELA.7.R.2.4": {
    "code": "ELA.7.R.2.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can track the development of an argument, analyzing the types of reasoning used and their effectiveness.",
      "Provide scaffolds, models, and non-examples that help students track the development of an argument, analyzing the types of reasoning used and their effectiveness in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will track the development of an argument, analyzing the types of reasoning used and their effectiveness with grade-level appropriate rigor.",
      "Students will explain their reasoning while they track the development of an argument, analyzing the types of reasoning used and their effectiveness.",
      "Students will transfer their understanding to real-world contexts that require them to track the development of an argument, analyzing the types of reasoning used and their effectiveness."
    ]
  },
  "ELA.7.R.3.1": {
    "code": "ELA.7.R.3.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can analyze how figurative language contributes to tone and meaning and explain examples of allusions in text(s).",
      "Provide scaffolds, models, and non-examples that help students analyze how figurative language contributes to tone and meaning and explain examples of allusions in text(s) in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze how figurative language contributes to tone and meaning and explain examples of allusions in text(s) with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze how figurative language contributes to tone and meaning and explain examples of allusions in text(s).",
      "Students will transfer their understanding to real-world contexts that require them to analyze how figurative language contributes to tone and meaning and explain examples of allusions in text(s)."
    ]
  },
  "ELA.7.R.3.2": {
    "code": "ELA.7.R.3.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can paraphrase content from grade-level texts.",
      "Provide scaffolds, models, and non-examples that help students paraphrase content from grade-level texts in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will paraphrase content from grade-level texts with grade-level appropriate rigor.",
      "Students will explain their reasoning while they paraphrase content from grade-level texts.",
      "Students will transfer their understanding to real-world contexts that require them to paraphrase content from grade-level texts."
    ]
  },
  "ELA.7.R.3.3": {
    "code": "ELA.7.R.3.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can compare and contrast how authors with differing perspectives address the same or related topics or themes.",
      "Provide scaffolds, models, and non-examples that help students compare and contrast how authors with differing perspectives address the same or related topics or themes in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare and contrast how authors with differing perspectives address the same or related topics or themes with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare and contrast how authors with differing perspectives address the same or related topics or themes.",
      "Students will transfer their understanding to real-world contexts that require them to compare and contrast how authors with differing perspectives address the same or related topics or themes."
    ]
  },
  "ELA.7.R.3.4": {
    "code": "ELA.7.R.3.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can explain the meaning and/or significance of rhetorical devices in a text.",
      "Provide scaffolds, models, and non-examples that help students explain the meaning and/or significance of rhetorical devices in a text in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the meaning and/or significance of rhetorical devices in a text with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the meaning and/or significance of rhetorical devices in a text.",
      "Students will transfer their understanding to real-world contexts that require them to explain the meaning and/or significance of rhetorical devices in a text."
    ]
  },
  "ELA.7.V.1.1": {
    "code": "ELA.7.V.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can integrate academic vocabulary appropriate to grade level in speaking and writing.",
      "Provide scaffolds, models, and non-examples that help students integrate academic vocabulary appropriate to grade level in speaking and writing in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will integrate academic vocabulary appropriate to grade level in speaking and writing with grade-level appropriate rigor.",
      "Students will explain their reasoning while they integrate academic vocabulary appropriate to grade level in speaking and writing.",
      "Students will transfer their understanding to real-world contexts that require them to integrate academic vocabulary appropriate to grade level in speaking and writing."
    ]
  },
  "ELA.7.V.1.2": {
    "code": "ELA.7.V.1.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content.",
      "Provide scaffolds, models, and non-examples that help students apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content with grade-level appropriate rigor.",
      "Students will explain their reasoning while they apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content.",
      "Students will transfer their understanding to real-world contexts that require them to apply knowledge of Greek and Latin roots and affixes to determine meanings of words and phrases in grade-level content."
    ]
  },
  "ELA.7.V.1.3": {
    "code": "ELA.7.V.1.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in English Language Arts can apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level.",
      "Provide scaffolds, models, and non-examples that help students apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level with grade-level appropriate rigor.",
      "Students will explain their reasoning while they apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level.",
      "Students will transfer their understanding to real-world contexts that require them to apply knowledge of context clues, figurative language, word relationships, reference materials, and/or background knowledge to determine the connotative and denotative meaning of words and phrases, appropriate to grade level."
    ]
  },
  "ELA.8.R.1.1": {
    "code": "ELA.8.R.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 8 learners in English Language Arts can cite textual evidence to support analysis of what the text says explicitly.",
      "Provide scaffolds, models, and non-examples that help students cite textual evidence to support analysis of what the text says explicitly in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will cite textual evidence to support analysis of what the text says explicitly with grade-level appropriate rigor.",
      "Students will explain their reasoning while they cite textual evidence to support analysis of what the text says explicitly.",
      "Students will transfer their understanding to real-world contexts that require them to cite textual evidence to support analysis of what the text says explicitly."
    ]
  },
  "ELA.8.R.2.4": {
    "code": "ELA.8.R.2.4",
    "clarifications": [
      "Clarify success criteria so Grade 8 learners in English Language Arts can analyze how an author develops a claim.",
      "Provide scaffolds, models, and non-examples that help students analyze how an author develops a claim in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze how an author develops a claim with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze how an author develops a claim.",
      "Students will transfer their understanding to real-world contexts that require them to analyze how an author develops a claim."
    ]
  },
  "SS.7.CG.1.1": {
    "code": "SS.7.CG.1.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze the influences of ancient Greece, ancient Rome and the Judeo-Christian tradition on America's constitutional republic.",
      "Provide scaffolds, models, and non-examples that help students analyze the influences of ancient Greece, ancient Rome and the Judeo-Christian tradition on America's constitutional republic in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the influences of ancient Greece, ancient Rome and the Judeo-Christian tradition on America's constitutional republic with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the influences of ancient Greece, ancient Rome and the Judeo-Christian tradition on America's constitutional republic.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the influences of ancient Greece, ancient Rome and the Judeo-Christian tradition on America's constitutional republic."
    ]
  },
  "SS.7.CG.1.10": {
    "code": "SS.7.CG.1.10",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can compare the viewpoints of the Federalists and the Anti-Federalists regarding ratification of the U.S. Constitution and including a bill of rights.",
      "Provide scaffolds, models, and non-examples that help students compare the viewpoints of the Federalists and the Anti-Federalists regarding ratification of the U.S. Constitution and including a bill of rights in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare the viewpoints of the Federalists and the Anti-Federalists regarding ratification of the U.S. Constitution and including a bill of rights with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare the viewpoints of the Federalists and the Anti-Federalists regarding ratification of the U.S. Constitution and including a bill of rights.",
      "Students will transfer their understanding to real-world contexts that require them to compare the viewpoints of the Federalists and the Anti-Federalists regarding ratification of the U.S. Constitution and including a bill of rights."
    ]
  },
  "SS.7.CG.1.11": {
    "code": "SS.7.CG.1.11",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can define the rule of law and recognize its influence on the development of legal, political and governmental systems in the United States.",
      "Provide scaffolds, models, and non-examples that help students define the rule of law and recognize its influence on the development of legal, political and governmental systems in the United States in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will define the rule of law and recognize its influence on the development of legal, political and governmental systems in the United States with grade-level appropriate rigor.",
      "Students will explain their reasoning while they define the rule of law and recognize its influence on the development of legal, political and governmental systems in the United States.",
      "Students will transfer their understanding to real-world contexts that require them to define the rule of law and recognize its influence on the development of legal, political and governmental systems in the United States."
    ]
  },
  "SS.7.CG.1.2": {
    "code": "SS.7.CG.1.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can trace the principles underlying America's founding ideas on law and government.",
      "Provide scaffolds, models, and non-examples that help students trace the principles underlying America's founding ideas on law and government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will trace the principles underlying America's founding ideas on law and government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they trace the principles underlying America's founding ideas on law and government.",
      "Students will transfer their understanding to real-world contexts that require them to trace the principles underlying America's founding ideas on law and government."
    ]
  },
  "SS.7.CG.1.3": {
    "code": "SS.7.CG.1.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can trace the impact that the Magna Carta, Mayflower Compact, English Bill of Rights and Thomas Paine's Common Sense had on colonists' views of government.",
      "Provide scaffolds, models, and non-examples that help students trace the impact that the Magna Carta, Mayflower Compact, English Bill of Rights and Thomas Paine's Common Sense had on colonists' views of government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will trace the impact that the Magna Carta, Mayflower Compact, English Bill of Rights and Thomas Paine's Common Sense had on colonists' views of government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they trace the impact that the Magna Carta, Mayflower Compact, English Bill of Rights and Thomas Paine's Common Sense had on colonists' views of government.",
      "Students will transfer their understanding to real-world contexts that require them to trace the impact that the Magna Carta, Mayflower Compact, English Bill of Rights and Thomas Paine's Common Sense had on colonists' views of government."
    ]
  },
  "SS.7.CG.1.4": {
    "code": "SS.7.CG.1.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze how Enlightenment ideas, including Montesquieu's view of separation of powers and John Locke's theories related to natural law and Locke's social contract, influenced the Founding.",
      "Provide scaffolds, models, and non-examples that help students analyze how Enlightenment ideas, including Montesquieu's view of separation of powers and John Locke's theories related to natural law and Locke's social contract, influenced the Founding in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze how Enlightenment ideas, including Montesquieu's view of separation of powers and John Locke's theories related to natural law and Locke's social contract, influenced the Founding with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze how Enlightenment ideas, including Montesquieu's view of separation of powers and John Locke's theories related to natural law and Locke's social contract, influenced the Founding.",
      "Students will transfer their understanding to real-world contexts that require them to analyze how Enlightenment ideas, including Montesquieu's view of separation of powers and John Locke's theories related to natural law and Locke's social contract, influenced the Founding."
    ]
  },
  "SS.7.CG.1.5": {
    "code": "SS.7.CG.1.5",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe how British policies and responses to colonial concerns led to the writing of the Declaration of Independence.",
      "Provide scaffolds, models, and non-examples that help students describe how British policies and responses to colonial concerns led to the writing of the Declaration of Independence in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe how British policies and responses to colonial concerns led to the writing of the Declaration of Independence with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe how British policies and responses to colonial concerns led to the writing of the Declaration of Independence.",
      "Students will transfer their understanding to real-world contexts that require them to describe how British policies and responses to colonial concerns led to the writing of the Declaration of Independence."
    ]
  },
  "SS.7.CG.1.6": {
    "code": "SS.7.CG.1.6",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze the ideas and grievances set forth in the Declaration of Independence.",
      "Provide scaffolds, models, and non-examples that help students analyze the ideas and grievances set forth in the Declaration of Independence in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the ideas and grievances set forth in the Declaration of Independence with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the ideas and grievances set forth in the Declaration of Independence.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the ideas and grievances set forth in the Declaration of Independence."
    ]
  },
  "SS.7.CG.1.7": {
    "code": "SS.7.CG.1.7",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain how the weaknesses of the Articles of Confederation led to the writing of the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students explain how the weaknesses of the Articles of Confederation led to the writing of the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain how the weaknesses of the Articles of Confederation led to the writing of the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain how the weaknesses of the Articles of Confederation led to the writing of the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to explain how the weaknesses of the Articles of Confederation led to the writing of the U.S. Constitution."
    ]
  },
  "SS.7.CG.1.8": {
    "code": "SS.7.CG.1.8",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the purpose of the Preamble to the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students explain the purpose of the Preamble to the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the purpose of the Preamble to the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the purpose of the Preamble to the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to explain the purpose of the Preamble to the U.S. Constitution."
    ]
  },
  "SS.7.CG.1.9": {
    "code": "SS.7.CG.1.9",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe how the U.S. Constitution limits the powers of government through separation of powers, checks and balances, individual rights, rule of law and due process of law.",
      "Provide scaffolds, models, and non-examples that help students describe how the U.S. Constitution limits the powers of government through separation of powers, checks and balances, individual rights, rule of law and due process of law in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe how the U.S. Constitution limits the powers of government through separation of powers, checks and balances, individual rights, rule of law and due process of law with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe how the U.S. Constitution limits the powers of government through separation of powers, checks and balances, individual rights, rule of law and due process of law.",
      "Students will transfer their understanding to real-world contexts that require them to describe how the U.S. Constitution limits the powers of government through separation of powers, checks and balances, individual rights, rule of law and due process of law."
    ]
  },
  "SS.7.CG.2.1": {
    "code": "SS.7.CG.2.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can define the term 'citizen,' and explain the constitutional means of becoming a U.S. citizen.",
      "Provide scaffolds, models, and non-examples that help students define the term 'citizen,' and explain the constitutional means of becoming a U.S. citizen in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will define the term 'citizen,' and explain the constitutional means of becoming a U.S. citizen with grade-level appropriate rigor.",
      "Students will explain their reasoning while they define the term 'citizen,' and explain the constitutional means of becoming a U.S. citizen.",
      "Students will transfer their understanding to real-world contexts that require them to define the term 'citizen,' and explain the constitutional means of becoming a U.S. citizen."
    ]
  },
  "SS.7.CG.2.10": {
    "code": "SS.7.CG.2.10",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the process for citizens to address a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue and determining a course of action.",
      "Provide scaffolds, models, and non-examples that help students explain the process for citizens to address a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue and determining a course of action in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the process for citizens to address a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue and determining a course of action with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the process for citizens to address a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue and determining a course of action.",
      "Students will transfer their understanding to real-world contexts that require them to explain the process for citizens to address a state or local problem by researching public policy alternatives, identifying appropriate government agencies to address the issue and determining a course of action."
    ]
  },
  "SS.7.CG.2.2": {
    "code": "SS.7.CG.2.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can differentiate between obligations and responsibilities of U.S. citizenship, and evaluate their impact on society.",
      "Provide scaffolds, models, and non-examples that help students differentiate between obligations and responsibilities of U.S. citizenship, and evaluate their impact on society in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will differentiate between obligations and responsibilities of U.S. citizenship, and evaluate their impact on society with grade-level appropriate rigor.",
      "Students will explain their reasoning while they differentiate between obligations and responsibilities of U.S. citizenship, and evaluate their impact on society.",
      "Students will transfer their understanding to real-world contexts that require them to differentiate between obligations and responsibilities of U.S. citizenship, and evaluate their impact on society."
    ]
  },
  "SS.7.CG.2.3": {
    "code": "SS.7.CG.2.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can identify and apply the rights contained in the Bill of Rights and other amendments to the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students identify and apply the rights contained in the Bill of Rights and other amendments to the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will identify and apply the rights contained in the Bill of Rights and other amendments to the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they identify and apply the rights contained in the Bill of Rights and other amendments to the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to identify and apply the rights contained in the Bill of Rights and other amendments to the U.S. Constitution."
    ]
  },
  "SS.7.CG.2.4": {
    "code": "SS.7.CG.2.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain how the U.S. Constitution and the Bill of Rights safeguard individual rights.",
      "Provide scaffolds, models, and non-examples that help students explain how the U.S. Constitution and the Bill of Rights safeguard individual rights in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain how the U.S. Constitution and the Bill of Rights safeguard individual rights with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain how the U.S. Constitution and the Bill of Rights safeguard individual rights.",
      "Students will transfer their understanding to real-world contexts that require them to explain how the U.S. Constitution and the Bill of Rights safeguard individual rights."
    ]
  },
  "SS.7.CG.2.5": {
    "code": "SS.7.CG.2.5",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe the trial process and the role of juries in the administration of justice at the state and federal levels.",
      "Provide scaffolds, models, and non-examples that help students describe the trial process and the role of juries in the administration of justice at the state and federal levels in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe the trial process and the role of juries in the administration of justice at the state and federal levels with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe the trial process and the role of juries in the administration of justice at the state and federal levels.",
      "Students will transfer their understanding to real-world contexts that require them to describe the trial process and the role of juries in the administration of justice at the state and federal levels."
    ]
  },
  "SS.7.CG.2.6": {
    "code": "SS.7.CG.2.6",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can examine the election and voting process at the local, state and national levels.",
      "Provide scaffolds, models, and non-examples that help students examine the election and voting process at the local, state and national levels in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will examine the election and voting process at the local, state and national levels with grade-level appropriate rigor.",
      "Students will explain their reasoning while they examine the election and voting process at the local, state and national levels.",
      "Students will transfer their understanding to real-world contexts that require them to examine the election and voting process at the local, state and national levels."
    ]
  },
  "SS.7.CG.2.7": {
    "code": "SS.7.CG.2.7",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can identify the constitutional qualifications required to hold state and national office.",
      "Provide scaffolds, models, and non-examples that help students identify the constitutional qualifications required to hold state and national office in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will identify the constitutional qualifications required to hold state and national office with grade-level appropriate rigor.",
      "Students will explain their reasoning while they identify the constitutional qualifications required to hold state and national office.",
      "Students will transfer their understanding to real-world contexts that require them to identify the constitutional qualifications required to hold state and national office."
    ]
  },
  "SS.7.CG.2.8": {
    "code": "SS.7.CG.2.8",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can examine the impact of media, individuals, and interest groups on monitoring and influencing government.",
      "Provide scaffolds, models, and non-examples that help students examine the impact of media, individuals, and interest groups on monitoring and influencing government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will examine the impact of media, individuals, and interest groups on monitoring and influencing government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they examine the impact of media, individuals, and interest groups on monitoring and influencing government.",
      "Students will transfer their understanding to real-world contexts that require them to examine the impact of media, individuals, and interest groups on monitoring and influencing government."
    ]
  },
  "SS.7.CG.2.9": {
    "code": "SS.7.CG.2.9",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze media and political communications and identify examples of bias, symbolism and propaganda.",
      "Provide scaffolds, models, and non-examples that help students analyze media and political communications and identify examples of bias, symbolism and propaganda in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze media and political communications and identify examples of bias, symbolism and propaganda with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze media and political communications and identify examples of bias, symbolism and propaganda.",
      "Students will transfer their understanding to real-world contexts that require them to analyze media and political communications and identify examples of bias, symbolism and propaganda."
    ]
  },
  "SS.7.CG.3.1": {
    "code": "SS.7.CG.3.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze the advantages of the United States' constitutional republic over other forms of government in safeguarding liberty, freedom and a representative government.",
      "Provide scaffolds, models, and non-examples that help students analyze the advantages of the United States' constitutional republic over other forms of government in safeguarding liberty, freedom and a representative government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the advantages of the United States' constitutional republic over other forms of government in safeguarding liberty, freedom and a representative government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the advantages of the United States' constitutional republic over other forms of government in safeguarding liberty, freedom and a representative government.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the advantages of the United States' constitutional republic over other forms of government in safeguarding liberty, freedom and a representative government."
    ]
  },
  "SS.7.CG.3.10": {
    "code": "SS.7.CG.3.10",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can identify sources and types of law.",
      "Provide scaffolds, models, and non-examples that help students identify sources and types of law in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will identify sources and types of law with grade-level appropriate rigor.",
      "Students will explain their reasoning while they identify sources and types of law.",
      "Students will transfer their understanding to real-world contexts that require them to identify sources and types of law."
    ]
  },
  "SS.7.CG.3.11": {
    "code": "SS.7.CG.3.11",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze the effects of landmark Supreme Court decisions on law, liberty and the interpretation of the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students analyze the effects of landmark Supreme Court decisions on law, liberty and the interpretation of the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the effects of landmark Supreme Court decisions on law, liberty and the interpretation of the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the effects of landmark Supreme Court decisions on law, liberty and the interpretation of the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the effects of landmark Supreme Court decisions on law, liberty and the interpretation of the U.S. Constitution."
    ]
  },
  "SS.7.CG.3.12": {
    "code": "SS.7.CG.3.12",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can compare the U.S. and Florida constitutions.",
      "Provide scaffolds, models, and non-examples that help students compare the U.S. and Florida constitutions in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will compare the U.S. and Florida constitutions with grade-level appropriate rigor.",
      "Students will explain their reasoning while they compare the U.S. and Florida constitutions.",
      "Students will transfer their understanding to real-world contexts that require them to compare the U.S. and Florida constitutions."
    ]
  },
  "SS.7.CG.3.13": {
    "code": "SS.7.CG.3.13",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain government obligations to its citizens and the services provided at the local, state and national levels.",
      "Provide scaffolds, models, and non-examples that help students explain government obligations to its citizens and the services provided at the local, state and national levels in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain government obligations to its citizens and the services provided at the local, state and national levels with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain government obligations to its citizens and the services provided at the local, state and national levels.",
      "Students will transfer their understanding to real-world contexts that require them to explain government obligations to its citizens and the services provided at the local, state and national levels."
    ]
  },
  "SS.7.CG.3.14": {
    "code": "SS.7.CG.3.14",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the purpose and function of the Electoral College in electing the President of the United States.",
      "Provide scaffolds, models, and non-examples that help students explain the purpose and function of the Electoral College in electing the President of the United States in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the purpose and function of the Electoral College in electing the President of the United States with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the purpose and function of the Electoral College in electing the President of the United States.",
      "Students will transfer their understanding to real-world contexts that require them to explain the purpose and function of the Electoral College in electing the President of the United States."
    ]
  },
  "SS.7.CG.3.15": {
    "code": "SS.7.CG.3.15",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze the advantages of capitalism and the free market in the United States over government-controlled economic systems (e.g., socialism and communism) in regard to economic freedom and raising the standard of living for citizens.",
      "Provide scaffolds, models, and non-examples that help students analyze the advantages of capitalism and the free market in the United States over government-controlled economic systems (e.g., socialism and communism) in regard to economic freedom and raising the standard of living for citizens in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze the advantages of capitalism and the free market in the United States over government-controlled economic systems (e.g., socialism and communism) in regard to economic freedom and raising the standard of living for citizens with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze the advantages of capitalism and the free market in the United States over government-controlled economic systems (e.g., socialism and communism) in regard to economic freedom and raising the standard of living for citizens.",
      "Students will transfer their understanding to real-world contexts that require them to analyze the advantages of capitalism and the free market in the United States over government-controlled economic systems (e.g., socialism and communism) in regard to economic freedom and raising the standard of living for citizens."
    ]
  },
  "SS.7.CG.3.2": {
    "code": "SS.7.CG.3.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the advantages of a federal system of government over other systems in balancing local sovereignty with national unity and protecting against authoritarianism.",
      "Provide scaffolds, models, and non-examples that help students explain the advantages of a federal system of government over other systems in balancing local sovereignty with national unity and protecting against authoritarianism in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the advantages of a federal system of government over other systems in balancing local sovereignty with national unity and protecting against authoritarianism with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the advantages of a federal system of government over other systems in balancing local sovereignty with national unity and protecting against authoritarianism.",
      "Students will transfer their understanding to real-world contexts that require them to explain the advantages of a federal system of government over other systems in balancing local sovereignty with national unity and protecting against authoritarianism."
    ]
  },
  "SS.7.CG.3.3": {
    "code": "SS.7.CG.3.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe the structure and function of the three branches of government established in the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students describe the structure and function of the three branches of government established in the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe the structure and function of the three branches of government established in the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe the structure and function of the three branches of government established in the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to describe the structure and function of the three branches of government established in the U.S. Constitution."
    ]
  },
  "SS.7.CG.3.4": {
    "code": "SS.7.CG.3.4",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the relationship between state and national governments as written in Article IV of the U.S. Constitution and the 10th Amendment.",
      "Provide scaffolds, models, and non-examples that help students explain the relationship between state and national governments as written in Article IV of the U.S. Constitution and the 10th Amendment in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the relationship between state and national governments as written in Article IV of the U.S. Constitution and the 10th Amendment with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the relationship between state and national governments as written in Article IV of the U.S. Constitution and the 10th Amendment.",
      "Students will transfer their understanding to real-world contexts that require them to explain the relationship between state and national governments as written in Article IV of the U.S. Constitution and the 10th Amendment."
    ]
  },
  "SS.7.CG.3.5": {
    "code": "SS.7.CG.3.5",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the amendment process outlined in Article V of the U.S. Constitution.",
      "Provide scaffolds, models, and non-examples that help students explain the amendment process outlined in Article V of the U.S. Constitution in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the amendment process outlined in Article V of the U.S. Constitution with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the amendment process outlined in Article V of the U.S. Constitution.",
      "Students will transfer their understanding to real-world contexts that require them to explain the amendment process outlined in Article V of the U.S. Constitution."
    ]
  },
  "SS.7.CG.3.6": {
    "code": "SS.7.CG.3.6",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can analyze how the 13th, 14th, 15th, 19th, 24th and 26th Amendments broadened participation in the political process.",
      "Provide scaffolds, models, and non-examples that help students analyze how the 13th, 14th, 15th, 19th, 24th and 26th Amendments broadened participation in the political process in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will analyze how the 13th, 14th, 15th, 19th, 24th and 26th Amendments broadened participation in the political process with grade-level appropriate rigor.",
      "Students will explain their reasoning while they analyze how the 13th, 14th, 15th, 19th, 24th and 26th Amendments broadened participation in the political process.",
      "Students will transfer their understanding to real-world contexts that require them to analyze how the 13th, 14th, 15th, 19th, 24th and 26th Amendments broadened participation in the political process."
    ]
  },
  "SS.7.CG.3.7": {
    "code": "SS.7.CG.3.7",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the structure, functions and processes of the legislative branch of government.",
      "Provide scaffolds, models, and non-examples that help students explain the structure, functions and processes of the legislative branch of government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the structure, functions and processes of the legislative branch of government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the structure, functions and processes of the legislative branch of government.",
      "Students will transfer their understanding to real-world contexts that require them to explain the structure, functions and processes of the legislative branch of government."
    ]
  },
  "SS.7.CG.3.8": {
    "code": "SS.7.CG.3.8",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the structure, functions and processes of the executive branch of government.",
      "Provide scaffolds, models, and non-examples that help students explain the structure, functions and processes of the executive branch of government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the structure, functions and processes of the executive branch of government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the structure, functions and processes of the executive branch of government.",
      "Students will transfer their understanding to real-world contexts that require them to explain the structure, functions and processes of the executive branch of government."
    ]
  },
  "SS.7.CG.3.9": {
    "code": "SS.7.CG.3.9",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the structure, functions and processes of the judicial branch of government.",
      "Provide scaffolds, models, and non-examples that help students explain the structure, functions and processes of the judicial branch of government in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the structure, functions and processes of the judicial branch of government with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the structure, functions and processes of the judicial branch of government.",
      "Students will transfer their understanding to real-world contexts that require them to explain the structure, functions and processes of the judicial branch of government."
    ]
  },
  "SS.7.CG.4.1": {
    "code": "SS.7.CG.4.1",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can explain the relationship between U.S. foreign and domestic policy.",
      "Provide scaffolds, models, and non-examples that help students explain the relationship between U.S. foreign and domestic policy in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will explain the relationship between U.S. foreign and domestic policy with grade-level appropriate rigor.",
      "Students will explain their reasoning while they explain the relationship between U.S. foreign and domestic policy.",
      "Students will transfer their understanding to real-world contexts that require them to explain the relationship between U.S. foreign and domestic policy."
    ]
  },
  "SS.7.CG.4.2": {
    "code": "SS.7.CG.4.2",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe the United States' and citizen participation in international organizations.",
      "Provide scaffolds, models, and non-examples that help students describe the United States' and citizen participation in international organizations in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe the United States' and citizen participation in international organizations with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe the United States' and citizen participation in international organizations.",
      "Students will transfer their understanding to real-world contexts that require them to describe the United States' and citizen participation in international organizations."
    ]
  },
  "SS.7.CG.4.3": {
    "code": "SS.7.CG.4.3",
    "clarifications": [
      "Clarify success criteria so Grade 7 learners in Civics can describe examples of the United States' actions and reactions in international conflicts.",
      "Provide scaffolds, models, and non-examples that help students describe examples of the United States' actions and reactions in international conflicts in both collaborative and independent settings."
    ],
    "objectives": [
      "Students will describe examples of the United States' actions and reactions in international conflicts with grade-level appropriate rigor.",
      "Students will explain their reasoning while they describe examples of the United States' actions and reactions in international conflicts.",
      "Students will transfer their understanding to real-world contexts that require them to describe examples of the United States' actions and reactions in international conflicts."
    ]
  }
}